In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn
import requests

In [4]:
victims_coords = pd.read_csv('victims_coords.csv')

victims_coords

,name,age,park,state,year,notes,latitude,longitude
0,David Michael Burney,46,Bankhead National Forest,Alabama,2007.0,NaN,34.301863,-87.414071
1,James Taylor Wall,30,Bankhead National Forest,Alabama,2015.0,NaN,34.301863,-87.414071
2,Kevin Robert O’Keefe,36,Glacier Bay National Park,Alaska,1985.0,NaN,58.814175,-136.872094
3,Micheal LeMaitre,65,Mt. Marathon,Alaska,2012.0,NaN,61.280047,-147.224095
4,Sandra Gelber,61,Glacier Bay National Park,Alaska,2014.0,NaN,58.814175,-136.872094
...,...,...,...,...,...,...,...,...
258,Frederick Gabriel,56,Canyonlands National Park,Utha,2015.0,NaN,38.233259,-109.920663
259,Carroll Donald Parkins,78,Mt. Hood National Forest,Oregon,2023.0,NaN,45.209965,-121.723232
260,Caleb Josiah Howard,32,Mt. Hood National Forest,Oregon,2017.0,NaN,45.209965,-121.723232
261,Cassie Renee Sheetz,24,Monongahela National Forest,West Virginia,2021.0,NaN,38.331613,-80.310683
262,Raymond Aronld Saunders,44,Smoky Mountains National Park,Tenessee,2022.0,NaN,35.634220,-83.402366

In [5]:
victims_coords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 263 entries, 0 to 262
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       263 non-null    object
 1   age        263 non-null    object
 2   park       263 non-null    object
 3   state      263 non-null    object
 4   year       260 non-null    float64
 5   notes      21 non-null     object
 6   latitude   233 non-null    float64
 7   longitude  232 non-null    float64
dtypes: float64(3), object(5)
memory usage: 16.6+ KB

In [6]:
victims_coords.describe()

              year    latitude   longitude
count   260.000000  233.000000  232.000000
mean   1996.107692   38.680700 -108.206208
std      23.128897   11.298356   32.722840
min    1909.000000  -43.209734 -155.729700
25%    1982.750000   36.097743 -120.481643
50%    2002.000000   37.839300 -117.961473
75%    2015.000000   43.991297 -108.247767
max    2024.000000   61.280047  175.197875

In [7]:
victims_coords.head(10)

,name,age,park,state,year,notes,latitude,longitude
0,David Michael Burney,46,Bankhead National Forest,Alabama,2007.0,NaN,34.301863,-87.414071
1,James Taylor Wall,30,Bankhead National Forest,Alabama,2015.0,NaN,34.301863,-87.414071
2,Kevin Robert O’Keefe,36,Glacier Bay National Park,Alaska,1985.0,NaN,58.814175,-136.872094
3,Micheal LeMaitre,65,Mt. Marathon,Alaska,2012.0,NaN,61.280047,-147.224095
4,Sandra Gelber,61,Glacier Bay National Park,Alaska,2014.0,NaN,58.814175,-136.872094
5,Sharon Buis,48,Glacier Bay National Park,Alaska,2014.0,body found,58.814175,-136.872094
6,Jonghyon Won,45,Grand Canyon,Arizona,2017.0,NaN,36.097743,-112.096762
7,Floyed E. Roberts III,52,Grand Canyon,Arizona,2016.0,NaN,36.097743,-112.096762
8,Morgan Heimer,22,Grand Canyon,Arizona,2015.0,NaN,36.097743,-112.096762
9,Drake Kramer,21,Grand Canyon,Arizona,2015.0,NaN,36.097743,-112.096762

In [8]:
#find missing values
missing_values = victims_coords.isnull()
missing_values

      name    age   park  state   year  notes  latitude  longitude
0    False  False  False  False  False   True     False      False
1    False  False  False  False  False   True     False      False
2    False  False  False  False  False   True     False      False
3    False  False  False  False  False   True     False      False
4    False  False  False  False  False   True     False      False
..     ...    ...    ...    ...    ...    ...       ...        ...
258  False  False  False  False  False   True     False      False
259  False  False  False  False  False   True     False      False
260  False  False  False  False  False   True     False      False
261  False  False  False  False  False   True     False      False
262  False  False  False  False  False   True     False      False

[263 rows x 8 columns]